# yolo26-mamba.yaml

nc: 80 # TODO CHANGE
end2end: True
reg_max: 1
scales:
  # n: [0.50, 0.25, 1024] 
backbone:
  # [from, repeats, module, args]
  # Original: [64, 3, 2] → Scaled: [64×0.25=16, 3, 2]
  - [-1, 1, Conv, [16, 3, 2]] # 0-P1/2
  
  # Original: [128, 3, 2] → Scaled: [128×0.25=32, 3, 2]
  - [-1, 1, Conv, [32, 3, 2]] # 1-P2/4
  
  # Original: [256, False, 0.25], repeats=2 → Scaled: [256×0.25=64, False, 0.25], repeats=2×0.5=1
  - [-1, 1, C3k2, [64, False, 0.25]]
  
  # Original: [256, 3, 2] → Scaled: [256×0.25=64, 3, 2]
  - [-1, 1, Conv, [64, 3, 2]] # 3-P3/8
  
  # Mamba block: [256×0.25=64, 16, 2]
  - [-1, 1, MambaBlock2, [64, 64, 16, 2]] # 4-Mamba at P3/8
  
  # Original: [512, False, 0.25], repeats=2 → Scaled: [512×0.25=128, False, 0.25], repeats=1
  - [-1, 1, C3k2, [128, False, 0.25]]
  
  # Original: [512, 3, 2] → Scaled: [512×0.25=128, 3, 2]
  - [-1, 1, Conv, [128, 3, 2]] # 6-P4/16
  
  # Mamba block: [512×0.25=128, 16, 2]
  - [-1, 1, MambaBlock2, [128, 128, 16, 2]] # 7-Mamba at P4/16
  
  # Original: [512, True], repeats=2 → Scaled: [512×0.25=128, True], repeats=1
  - [-1, 1, C3k2, [128, True]]
  
  # Original: [1024, 3, 2] → Scaled: [1024×0.25=256, 3, 2]
  - [-1, 1, Conv, [256, 3, 2]] # 9-P5/32
  
  # Mamba block: [1024×0.25=256, 16, 2]
  - [-1, 1, MambaBlock2, [256, 256, 16, 2]] # 10-Mamba at P5/32
  
  # Original: [1024, True], repeats=2 → Scaled: [1024×0.25=256, True], repeats=1
  - [-1, 1, C3k2, [256, True]]
  
  # Original: [1024, 5, 3, True] → Scaled: [256, 5, 3, True]
  - [-1, 1, SPPF, [256, 5, 3, True]] # 12
  
  # Original: [1024], repeats=2 → Scaled: [256], repeats=1
  - [-1, 1, C2PSA, [256]] # 13

# YOLO26 head - also scaled!
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 7], 1, Concat, [1]] # cat backbone P4
  
  # Original: [512, True], repeats=2 → Scaled: [128, True], repeats=1
  - [-1, 1, C3k2, [128, True]] # 16

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]] # cat backbone P3
  
  # Original: [256, True], repeats=2 → Scaled: [64, True], repeats=1
  - [-1, 1, C3k2, [64, True]] # 19 (P3/8-small)

  # Original: [256, 3, 2] → Scaled: [64, 3, 2]
  - [-1, 1, Conv, [64, 3, 2]]
  - [[-1, 16], 1, Concat, [1]] # cat head P4
  
  # Original: [512, True], repeats=2 → Scaled: [128, True], repeats=1
  - [-1, 1, C3k2, [128, True]] # 22 (P4/16-medium)

  # Original: [512, 3, 2] → Scaled: [128, 3, 2]
  - [-1, 1, Conv, [128, 3, 2]]
  - [[-1, 13], 1, Concat, [1]] # cat head P5
  
  # Original: [1024, True, 0.5, True] → Scaled: [256, True, 0.5, True]
  - [-1, 1, C3k2, [256, True, 0.5, True]] # 25 (P5/32-large)

  - [[19, 22, 25], 1, Detect, [nc]] # Detect(P3, P4, P5)