# yolo26-v-mamba-pure-neck.yaml
# Backbone + Neck: pure VSSMBlock (VMamba library VSSBlock), no C3k2

nc: 1
end2end: True
reg_max: 1

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [16, 3, 2]]               # 0-P1/2
  - [-1, 1, Conv, [32, 3, 2]]               # 1-P2/4
  - [-1, 1, Conv, [64, 3, 2]]               # 2-P3/8

  # VSSMBlock args: [dim, d_state, ssm_ratio, d_conv]
  - [-1, 1, VSSMBlock, [64, 16, 2.0, 3]]   # 3-VSS at P3/8

  - [-1, 1, Conv, [128, 3, 2]]              # 4-P4/16
  - [-1, 1, VSSMBlock, [128, 16, 2.0, 3]]  # 5-VSS at P4/16

  - [-1, 1, Conv, [256, 3, 2]]              # 6-P5/32
  - [-1, 1, VSSMBlock, [256, 16, 2.0, 3]]  # 7-VSS at P5/32

  - [-1, 1, SPPF, [256, 5, 3, True]]       # 8
  - [-1, 1, C2PSA, [256]]                  # 9

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 10
  - [[-1, 5], 1, Concat, [1]]                    # 11 - cat with P4 (256+128=384)
  - [-1, 1, Conv, [128, 1, 1]]                   # 12 - 1x1 conv to reduce 384→128
  - [-1, 1, VSSMBlock, [128, 16, 2.0, 3]]        # 13 - VSS neck at P4

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 14
  - [[-1, 3], 1, Concat, [1]]                    # 15 - cat with P3 (128+64=192)
  - [-1, 1, Conv, [64, 1, 1]]                    # 16 - 1x1 conv to reduce 192→64
  - [-1, 1, VSSMBlock, [64, 16, 2.0, 3]]         # 17 (P3/8-small)

  - [-1, 1, Conv, [64, 3, 2]]                    # 18
  - [[-1, 13], 1, Concat, [1]]                   # 19 - cat with neck P4 (64+128=192)
  - [-1, 1, Conv, [128, 1, 1]]                   # 20 - 1x1 conv to reduce 192→128
  - [-1, 1, VSSMBlock, [128, 16, 2.0, 3]]        # 21 (P4/16-medium)

  - [-1, 1, Conv, [128, 3, 2]]                   # 22
  - [[-1, 9], 1, Concat, [1]]                    # 23 - cat with C2PSA (128+256=384)
  - [-1, 1, Conv, [256, 1, 1]]                   # 24 - 1x1 conv to reduce 384→256
  - [-1, 1, VSSMBlock, [256, 16, 2.0, 3]]        # 25 (P5/32-large)

  - [[17, 21, 25], 1, Detect, [nc]]              # 26
