# yolo26-mamba2-rope.yaml
# Backbone: VSSMBlock_Mamba2 (Triton SSD kernel) with Rotary Position Embedding
# RoPE applied to B and C projections a la Mamba-3.
#
# VSSMBlock_Mamba2 YAML args:
#   [dim, d_state, ssm_ratio, d_conv, headdim, chunk_size, ngroups, mlp_ratio, use_rope]
#   - d_state must be even for RoPE (64 satisfies this)
#   - d_inner (= ssm_ratio * dim) must be divisible by headdim

nc: 1
end2end: True
reg_max: 1

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [16, 3, 2]]               # 0-P1/2
  - [-1, 1, Conv, [32, 3, 2]]               # 1-P2/4
  - [-1, 1, Conv, [64, 3, 2]]               # 2-P3/8

  # VSSMBlock_Mamba2 args: [dim, d_state=64, ssm_ratio=2, d_conv=3, headdim=64, chunk_size=256, ngroups=1, mlp_ratio=0, use_rope=True]
  # d_inner=128 divisible by headdim=64 ✓  |  d_state=64 even → RoPE valid ✓
  - [-1, 1, VSSMBlock_Mamba2, [64, 64, 2.0, 3, 64, 256, 1, 2.0, True]]   # 3-VSS+RoPE at P3/8

  - [-1, 1, Conv, [128, 3, 2]]              # 4-P4/16
  # d_inner=256 divisible by headdim=64 ✓
  - [-1, 1, VSSMBlock_Mamba2, [128, 64, 2.0, 3, 64, 256, 1, 2.0, True]]  # 5-VSS+RoPE at P4/16

  - [-1, 1, Conv, [256, 3, 2]]              # 6-P5/32
  # d_inner=512 divisible by headdim=64 ✓
  - [-1, 1, VSSMBlock_Mamba2, [256, 64, 2.0, 3, 64, 256, 1, 2.0, True]]  # 7-VSS+RoPE at P5/32

  - [-1, 1, SPPF, [256, 5, 3, True]]       # 8
  - [-1, 1, C2PSA, [256]]                  # 9

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 10
  - [[-1, 5], 1, Concat, [1]]                    # 11 - cat with P4
  - [-1, 1, C3k2, [128, True]]                   # 12
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 13
  - [[-1, 3], 1, Concat, [1]]                    # 14 - cat with P3
  - [-1, 1, C3k2, [64, True]]                    # 15 (P3/8-small)
  - [-1, 1, Conv, [64, 3, 2]]                    # 16
  - [[-1, 12], 1, Concat, [1]]                   # 17
  - [-1, 1, C3k2, [128, True]]                   # 18 (P4/16-medium)
  - [-1, 1, Conv, [128, 3, 2]]                   # 19
  - [[-1, 9], 1, Concat, [1]]                    # 20 - cat with C2PSA
  - [-1, 1, C3k2, [256, True, 0.5, True]]        # 21 (P5/32-large)
  - [[15, 18, 21], 1, Detect, [nc]]              # 22
