# yolo26-v-mamba.yaml - C3k2 removed from backbone

nc: 2
end2end: True
reg_max: 1
scales:
  # n: [0.50, 0.25, 1024] 

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [16, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [32, 3, 2]] # 1-P2/4
  - [-1, 1, Conv, [64, 3, 2]] # 2-P3/8 (replaced C3k2 with Conv)
  
  # VMamba block at P3/8 - [dim, expand, d_state, d_conv]
  - [-1, 1, VMambaBlock, [64, 16, 2, 3]] # 3-VMamba at P3/8
  
  - [-1, 1, Conv, [128, 3, 2]] # 4-P4/16 (replaced C3k2 with Conv)
  
  # VMamba block at P4/16
  - [-1, 1, VMambaBlock, [128, 16, 2, 3]] # 5-VMamba at P4/16
  
  - [-1, 1, Conv, [256, 3, 2]] # 6-P5/32 (replaced C3k2 with Conv)
  
  # VMamba block at P5/32
  - [-1, 1, VMambaBlock, [256, 16, 2, 3]] # 7-VMamba at P5/32
  
  - [-1, 1, SPPF, [256, 5, 3, True]] # 8
  - [-1, 1, C2PSA, [256]] # 9

# YOLO26 head - unchanged
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 5], 1, Concat, [1]]  # Note: indices updated (was -1,7)
  - [-1, 1, C3k2, [128, True]] # 12 (was 16)
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 3], 1, Concat, [1]]  # Note: indices updated (was -1,4)
  - [-1, 1, C3k2, [64, True]]  # 15 (P3/8-small) (was 19)
  - [-1, 1, Conv, [64, 3, 2]]
  - [[-1, 12], 1, Concat, [1]] # Note: indices updated (was -1,16)
  - [-1, 1, C3k2, [128, True]] # 18 (P4/16-medium) (was 22)
  - [-1, 1, Conv, [128, 3, 2]]
  - [[-1, 9], 1, Concat, [1]]  # Note: indices updated (was -1,13)
  - [-1, 1, C3k2, [256, True, 0.5, True]] # 21 (P5/32-large) (was 25)
  - [[15, 18, 21], 1, Detect, [nc]] # Note: indices updated (was 19,22,25)