# yolo26-v-mamba.yaml

nc: 2
end2end: True
reg_max: 1
scales:
  # n: [0.50, 0.25, 1024] 

backbone:
    # [from, repeats, module, args]
  - [-1, 1, Conv, [16, 3, 2]]               # 0-P1/2
  - [-1, 1, Conv, [32, 3, 2]]               # 1-P2/4
  - [-1, 1, Conv, [64, 3, 2]]               # 2-P3/8

  # VMamba3Block args: [dim, d_state, expand, headdim, mimo_rank]
  - [-1, 1, VMambaBlock, [64, 16, 2, 3, False, 'v2']]   # 3-VSS at P3/8

  - [-1, 1, Conv, [128, 3, 2]]              # 4-P4/16
  - [-1, 1, VMambaBlock, [128, 16, 2, 3, False, 'v2']]  # 5-VSS at P4/16

  - [-1, 1, Conv, [256, 3, 2]]              # 6-P5/32
  - [-1, 1, VMambaBlock, [256, 16, 2, 3, False, 'v2']]  # 7-VSS at P5/32

  - [-1, 1, SPPF, [256, 5, 3, True]]       # 8
  - [-1, 1, C2PSA, [256]]                  # 9

# YOLO26 head - unchanged
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 10
  - [[-1, 5], 1, Concat, [1]]                    # 11 - cat with P4 (was 7)
  - [-1, 1, C3k2, [128, True]]                   # 12
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 13
  - [[-1, 3], 1, Concat, [1]]                    # 14 - cat with P3 (was 4)
  - [-1, 1, C3k2, [64, True]]                    # 15 (P3/8-small)
  - [-1, 1, Conv, [64, 3, 2]]                    # 16
  - [[-1, 12], 1, Concat, [1]]                   # 17 - cat with head 12 (was 16)
  - [-1, 1, C3k2, [128, True]]                   # 18 (P4/16-medium)
  - [-1, 1, Conv, [128, 3, 2]]                   # 19
  - [[-1, 9], 1, Concat, [1]]                    # 20 - cat with C2PSA (was 13)
  - [-1, 1, C3k2, [256, True, 0.5, True]]        # 21 (P5/32-large)
  - [[15, 18, 21], 1, Detect, [nc]]              # 22 (was [19, 22, 25])