# yolo26n-vmamba-neck.yaml

nc: 80
end2end: True
reg_max: 1

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [16, 3, 2]]               # 0-P1/2
  - [-1, 1, Conv, [32, 3, 2]]               # 1-P2/4
  - [-1, 1, C3k2, [64, False, 0.25]]        # 2
  - [-1, 1, Conv, [64, 3, 2]]               # 3-P3/8
  - [-1, 1, C3k2, [128, False, 0.25]]       # 4
  - [-1, 1, Conv, [128, 3, 2]]              # 5-P4/16
  - [-1, 1, C3k2, [128, True]]              # 6
  - [-1, 1, Conv, [256, 3, 2]]              # 7-P5/32
  - [-1, 1, C3k2, [256, True]]              # 8
  - [-1, 1, SPPF, [256, 5, 3, True]]                           # 9
  # VSSMBlock_Mamba2 args: [dim, d_state, ssm_ratio, d_conv, headdim, chunk_size, ngroups]
  # d_inner=512, headdim=64 → 8 heads | 400 tokens at P5/32 (640px input)
  - [-1, 1, VSSMBlock, [256, 16, 2.0, 3]] # 10

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 11
  - [[-1, 6], 1, Concat, [1]]                    # 12 - cat backbone P4
  - [-1, 1, C3k2, [128, True]]                   # 13

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 14
  - [[-1, 4], 1, Concat, [1]]                    # 15 - cat backbone P3
  - [-1, 1, C3k2, [64, True]]                    # 16 (P3/8-small)

  - [-1, 1, Conv, [64, 3, 2]]                    # 17
  - [[-1, 13], 1, Concat, [1]]                   # 18 - cat head P4
  - [-1, 1, C3k2, [128, True]]                   # 19 (P4/16-medium)

  - [-1, 1, Conv, [128, 3, 2]]                   # 20
  - [[-1, 10], 1, Concat, [1]]                   # 21 - cat head P5
  - [-1, 1, C3k2, [256, True, 0.5, True]]        # 22 (P5/32-large)

  - [[16, 19, 22], 1, Detect, [nc]]              # 23
