# yolo26-v-mamba2-moreheads.yaml

# Scale  dim  d_inner  headdim  nheads  ngroups  d_state
# P3/8    64    128      16        8       8        32
# P4/16  128    256      16       16      16        32
# P5/32  256    512      16       32      32        32

nc: 1
end2end: True
reg_max: 1

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [16, 3, 2]]               # 0-P1/2
  - [-1, 1, Conv, [32, 3, 2]]               # 1-P2/4
  - [-1, 1, Conv, [64, 3, 2]]               # 2-P3/8

  # P3: d_inner=128, headdim=16 → 8 heads, ngroups=8 (each head own B/C)
  - [-1, 1, VSSMBlock_Mamba2, [64, 32, 2.0, 3, 16, 256, 8]]   # 3-VSS at P3/8

  - [-1, 1, Conv, [128, 3, 2]]              # 4-P4/16
  # P4: d_inner=256, headdim=16 → 16 heads, ngroups=16
  - [-1, 1, VSSMBlock_Mamba2, [128, 32, 2.0, 3, 16, 256, 16]] # 5-VSS at P4/16

  - [-1, 1, Conv, [256, 3, 2]]              # 6-P5/32
  # P5: d_inner=512, headdim=16 → 32 heads, ngroups=32
  - [-1, 1, VSSMBlock_Mamba2, [256, 32, 2.0, 3, 16, 256, 32]] # 7-VSS at P5/32

  - [-1, 1, SPPF, [256, 5, 3, True]]       # 8
  - [-1, 1, C2PSA, [256]]                  # 9

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 10
  - [[-1, 5], 1, Concat, [1]]                    # 11
  - [-1, 1, C3k2, [128, True]]                   # 12
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 13
  - [[-1, 3], 1, Concat, [1]]                    # 14
  - [-1, 1, C3k2, [64, True]]                    # 15 (P3/8-small)
  - [-1, 1, Conv, [64, 3, 2]]                    # 16
  - [[-1, 12], 1, Concat, [1]]                   # 17
  - [-1, 1, C3k2, [128, True]]                   # 18 (P4/16-medium)
  - [-1, 1, Conv, [128, 3, 2]]                   # 19
  - [[-1, 9], 1, Concat, [1]]                    # 20
  - [-1, 1, C3k2, [256, True, 0.5, True]]        # 21 (P5/32-large)
  - [[15, 18, 21], 1, Detect, [nc]]              # 22
