# yolo26-v-mamba-pure-rope.yaml
# Backbone: pure VSSMBlock (VMamba library VSSBlock w/ RoPE), no C3k2
# VSSMBlock args: [dim, d_state, ssm_ratio, d_conv, mlp_ratio, use_rope, rope_theta]
# d_state=32 (even, required for RoPE; rotates d_state/2 complex pairs)
# use_rope=1 (True)

nc: 1
end2end: True
reg_max: 1

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [16, 3, 2]]               # 0-P1/2
  - [-1, 1, Conv, [32, 3, 2]]               # 1-P2/4
  - [-1, 1, Conv, [64, 3, 2]]               # 2-P3/8

  # VSSMBlock args: [dim, d_state, ssm_ratio, d_conv, mlp_ratio, use_rope, rope_theta]
  - [-1, 1, VSSMBlock, [64, 32, 2.0, 3, 4.0, 1, 10000.0]]   # 3-VSS+RoPE at P3/8

  - [-1, 1, Conv, [128, 3, 2]]              # 4-P4/16
  - [-1, 1, VSSMBlock, [128, 32, 2.0, 3, 4.0, 1, 10000.0]]  # 5-VSS+RoPE at P4/16

  - [-1, 1, Conv, [256, 3, 2]]              # 6-P5/32
  - [-1, 1, VSSMBlock, [256, 32, 2.0, 3, 4.0, 1, 10000.0]]  # 7-VSS+RoPE at P5/32

  - [-1, 1, SPPF, [256, 5, 3, True]]       # 8
  - [-1, 1, C2PSA, [256]]                  # 9

# YOLO26 head - unchanged structure
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 10
  - [[-1, 5], 1, Concat, [1]]                    # 11 - cat with P4
  - [-1, 1, C3k2, [128, True]]                   # 12
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 13
  - [[-1, 3], 1, Concat, [1]]                    # 14 - cat with P3
  - [-1, 1, C3k2, [64, True]]                    # 15 (P3/8-small)
  - [-1, 1, Conv, [64, 3, 2]]                    # 16
  - [[-1, 12], 1, Concat, [1]]                   # 17 - cat with head 12
  - [-1, 1, C3k2, [128, True]]                   # 18 (P4/16-medium)
  - [-1, 1, Conv, [128, 3, 2]]                   # 19
  - [[-1, 9], 1, Concat, [1]]                    # 20 - cat with C2PSA
  - [-1, 1, C3k2, [256, True, 0.5, True]]        # 21 (P5/32-large)
  - [[15, 18, 21], 1, Detect, [nc]]              # 22
