# yolo26-v-mamba.yaml

nc: 2
end2end: True
reg_max: 1
scales:
  # n: [0.50, 0.25, 1024] 
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [16, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [32, 3, 2]] # 1-P2/4
  - [-1, 1, C3k2, [64, False, 0.25]]
  - [-1, 1, Conv, [64, 3, 2]] # 3-P3/8
  
  # VMamba block at P3/8 - [dim, expand, d_state, d_conv]
  - [-1, 1, VMambaBlock2Way, [64, 16, 2, 3]] # 4-VMamba at P3/8
  
  - [-1, 1, C3k2, [128, False, 0.25]]
  - [-1, 1, Conv, [128, 3, 2]] # 6-P4/16
  
  # VMamba block at P4/16
  - [-1, 1, VMambaBlock2Way, [128, 16, 2, 3]] # 7-VMamba at P4/16
  
  - [-1, 1, C3k2, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]] # 9-P5/32
  
  # VMamba block at P5/32
  - [-1, 1, VMambaBlock2Way, [256, 16, 2, 3]] # 10-VMamba at P5/32
  
  - [-1, 1, C3k2, [256, True]]
  - [-1, 1, SPPF, [256, 5, 3, True]] # 12
  - [-1, 1, C2PSA, [256]] # 13

# YOLO26 head - unchanged
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 7], 1, Concat, [1]]
  - [-1, 1, C3k2, [128, True]] # 16
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 1, C3k2, [64, True]] # 19 (P3/8-small)
  - [-1, 1, Conv, [64, 3, 2]]
  - [[-1, 16], 1, Concat, [1]]
  - [-1, 1, C3k2, [128, True]] # 22 (P4/16-medium)
  - [-1, 1, Conv, [128, 3, 2]]
  - [[-1, 13], 1, Concat, [1]]
  - [-1, 1, C3k2, [256, True, 0.5, True]] # 25 (P5/32-large)
  - [[19, 22, 25], 1, Detect, [nc]]